Revit 2027 API
ParameterTypeId.DividedSurfacePatternLinesStyle Property
 "Pattern Lines Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfacePatternLinesStyle { get; }
Public Shared ReadOnly Property DividedSurfacePatternLinesStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfacePatternLinesStyle {
	ForgeTypeId^ get ();
}
static member DividedSurfacePatternLinesStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace